venki666/CPE403AES/CC1350/adcLevelTrigger_CC1350_LAUNCHXL_TI/Debug/configPkg/package/cfg/empty_min_pem3.c
/* moduleStateCheckFlag__C */
#pragma DATA_SECTION(ti_sysbios_knl_Task_moduleStateCheckFlag__C, ".const:ti_sysbios_knl_Task_moduleStateCheckFlag__C");
__FAR__ const CT__ti_sysbios_knl_Task_moduleStateCheckFlag ti_sysbios_knl_Task_moduleStateCheckFlag__C = 0;

/* objectCheckFxn__C */
#pragma DATA_SECTION(ti_sysbios_knl_Task_objectCheckFxn__C, ".const:ti_sysbios_knl_Task_objectCheckFxn__C");
__FAR__ const CT__ti_sysbios_knl_Task_objectCheckFxn ti_sysbios_knl_Task_objectCheckFxn__C = ((CT__ti_sysbios_knl_Task_objectCheckFxn)((xdc_Fxn)ti_sysbios_knl_Task_objectCheck__I));

/* objectCheckValueFxn__C */
#pragma DATA_SECTION(ti_sysbios_knl_Task_objectCheckValueFxn__C, ".const:ti_sysbios_knl_Task_objectCheckValueFxn__C");
__FAR__ const CT__ti_sysbios_knl_Task_objectCheckValueFxn ti_sysbios_knl_Task_objectCheckValueFxn__C = ((CT__ti_sysbios_knl_Task_objectCheckValueFxn)((xdc_Fxn)ti_sysbios_knl_Task_getObjectCheckValue__I));

/* objectCheckFlag__C */
#pragma DATA_SECTION(ti_sysbios_knl_Task_objectCheckFlag__C, ".const:ti_sysbios_knl_Task_objectCheckFlag__C");
__FAR__ const CT__ti_sysbios_knl_Task_objectCheckFlag ti_sysbios_knl_Task_objectCheckFlag__C = 0;

/* numConstructedTasks__C */
#pragma DATA_SECTION(ti_sysbios_knl_Task_numConstructedTasks__C, ".const:ti_sysbios_knl_Task_numConstructedTasks__C");
__FAR__ const CT__ti_sysbios_knl_Task_numConstructedTasks ti_sysbios_knl_Task_numConstructedTasks__C = (xdc_UInt)0x0;

/* startupHookFunc__C */
#pragma DATA_SECTION(ti_sysbios_knl_Task_startupHookFunc__C, ".const:ti_sysbios_knl_Task_startupHookFunc__C");
__FAR__ const CT__ti_sysbios_knl_Task_startupHookFunc ti_sysbios_knl_Task_startupHookFunc__C = ((CT__ti_sysbios_knl_Task_startupHookFunc)0);


/*
 * ======== ti.sysbios.knl.Task_SupportProxy INITIALIZERS ========
 */


/*
 * ======== ti.sysbios.rom.cortexm.cc13xx.CC13xx INITIALIZERS ========
 */

/* Module__diagsEnabled__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__diagsEnabled__C, ".const:ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__diagsEnabled__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__diagsEnabled ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__diagsEnabled__C = (xdc_Bits32)0x90;

/* Module__diagsIncluded__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__diagsIncluded__C, ".const:ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__diagsIncluded__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__diagsIncluded ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__diagsIncluded__C = (xdc_Bits32)0x90;

/* Module__diagsMask__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__diagsMask__C, ".const:ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__diagsMask__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__diagsMask ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__diagsMask__C = ((CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__diagsMask)0);

/* Module__gateObj__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__gateObj__C, ".const:ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__gateObj__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__gateObj ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__gateObj__C = ((CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__gateObj)0);

/* Module__gatePrms__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__gatePrms__C, ".const:ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__gatePrms__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__gatePrms ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__gatePrms__C = ((CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__gatePrms)0);

/* Module__id__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__id__C, ".const:ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__id__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__id ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__id__C = (xdc_Bits16)0x2c;

/* Module__loggerDefined__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerDefined__C, ".const:ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerDefined__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerDefined ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerDefined__C = 0;

/* Module__loggerObj__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerObj__C, ".const:ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerObj__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerObj ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerObj__C = ((CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerObj)0);

/* Module__loggerFxn0__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn0__C, ".const:ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn0__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn0 ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn0__C = ((CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn0)0);

/* Module__loggerFxn1__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn1__C, ".const:ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn1__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn1 ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn1__C = ((CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn1)0);

/* Module__loggerFxn2__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn2__C, ".const:ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn2__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn2 ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn2__C = ((CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn2)0);

/* Module__loggerFxn4__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn4__C, ".const:ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn4__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn4 ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn4__C = ((CT__ti_sysbios_rom_cortexm_cc13xx_CC13xx_Module__loggerFxn4)0);

